import java.util.Scanner;

public class Interpersonal {
    /************************************************フィールド************************************************/

    private int hand1P;
    private int hand2P;

    //入力するためにスキャナークラスをインスタンス化
    Scanner stdIn = new Scanner(System.in);

    /************************************************コンストラクタ************************************************/


    /************************************************メソッド************************************************/
    public void InterpersonalRockPaperScissors() {
        //指定された整数値を入力されるまでループさせる（一人目）
        while (true) {
            //例外処理で文字が入らないようにする
            try {
                //選択肢を表示させる
                System.out.println("一人目は出す手を決めてね！\nグー：1　パー：2　チョキ：3");
                hand1P = stdIn.nextInt();
                if (hand1P <= 0 || hand1P > 3) {
                    System.out.println("指定された数値を入力してね！");
                }
                else {
                    break;
                }
            }
            //文字を入力された場合
            catch (Exception e) {
                stdIn.nextLine();
                System.out.println("半角英数字の指定された整数を入力してね！");
                //じゃんけんの選択肢にない整数をhand1Pに入れる
                hand1P = 0;
            }
        }

        //二人目の人が一人目の手を見ないように改行する
        for (int i = 0; i < 30; i++) {
            System.out.println();
        }

        //指定された整数値を入力されるまでループさせる（二人目）
        while (true) {
            //例外処理で文字が入らないようにする
            try {
                //選択肢を表示させる
                System.out.println("二人目人目は出す手を決めてね！\nグー：1　パー：2　チョキ：3");
                hand2P = stdIn.nextInt();
                if (hand2P <= 0 || hand2P > 3) {
                    System.out.println("指定された数値を入力してね！");
                }
                else {
                    break;
                }
            }
            //文字を入力された場合
            catch (Exception e) {
                stdIn.nextLine();
                System.out.println("半角英数字の指定された整数を入力してね！");
                //じゃんけんの選択肢にない整数をhand2Pに入れる
                hand2P = 0;
            }
        }

        //じゃんけんの処理
        //一人目の手がグーの時
        if (hand1P == 1) {
            //一人目の手がグーの時で二人目の手がグーの時
            if (hand2P == 1) {
                System.out.println("あいこ！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
            //一人目の手がグーの時で二人目の手がパーの時
            else if (hand2P == 2) {
                System.out.println("二人目の勝ち！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
            //一人目の手がグーの時で二人目の手がチョキの時
            else if (hand2P == 3) {
                System.out.println("一人目の勝ち！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
        }

        //一人目の手がパーの時
        if (hand1P == 2) {
            //一人目の手がパーの時で二人目の手がグーの時
            if (hand2P == 1) {
                System.out.println("一人目の勝ち！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
            //一人目の手がパーの時で二人目の手がパーの時
            else if (hand2P == 2) {
                System.out.println("あいこ！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
            //一人目の手がパーの時で二人目の手がチョキの時
            else if (hand2P == 3) {
                System.out.println("二人目の勝ち！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
        }

        //一人目の手がチョキの時
        if (hand1P == 3) {
            //一人目の手がチョキの時で二人目の手がグーの時
            if (hand2P == 1) {
                System.out.println("二人目の勝ち！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
            //一人目の手がチョキの時で二人目の手がパーの時
            else if (hand2P == 2) {
                System.out.println("一人目の勝ち！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
            //一人目の手がチョキの時で二人目の手がチョキの時
            else if (hand2P == 3) {
                System.out.println("あいこ！");
                System.out.println("-----------------------------------------------------------------------------------");
            }
        }
    }
}
